"use strict";

//====================================================================================================================\\
//============================================ ИМПОРТ НЕОБХОДИМЫХ МОДУЛЕЙ ============================================\\
//====================================================================================================================\\

import createConfig from "./2_createConfig.js";     // Создание конфигурации страницы
import renderTable from "./3_render-table.js";      // Создание таблицы с продуктами
import filterSearch from "./4_filter-search.js";    // Создание фильтра с ползунками
import filterRange from "./5_filter-range.js";      // Создание фильтра с типом продукта
import service from "../service.js";                // Реализация запросов на сервер

//====================================================================================================================\\
//==================================== МОДУЛЬ, ОТВЕЧАЮЩИЙ ЗА СТРАНИЦУ С ПРОДУКТАМИ ===================================\\
//====================================================================================================================\\

const products = () => {
    console.log("СТРАНИЦА С ПРОДУКТАМИ");

    // Получение необходимых элементов:
    const table = document.querySelector(".products__table tbody");                 // Таблица с продуктами
    const filters = document.querySelectorAll(".filter-range[data-filter-type]");   // Фильтры

    // Конфигурация страницы:
    const page = {
        items: null,                            // Полученные с сервера продукты
        kcal: {minVal: 0, maxVal: 0},           // Информация о калориях выводимых продуктов
        proteins: {minVal: 0, maxVal: 0},       // Информация о белках выводимых продуктов
        fats: {minVal: 0, maxVal: 0},           // Информация о жирах выводимых продуктов
        carbohydrates: {minVal: 0, maxVal: 0},  // Информация о калориях выводимых продуктов
        weight : 1                              // Информация о весе выводимых продуктов
    };

    // Получение продуктов при первой загрузке страницы:
    console.log("Выполнение запроса на получение продуктов");
    service.getData("/products/type/random")
    // При успешном получении продуктов:
    .then(products => {
        createConfig(page, products);                   // Создание конфигурации страницы
        renderTable(page, table);                       // Создание таблицы
        filterSearch(page, table, filters, 36, 6);      // Создание фильтра с типом продукта:
        filters.forEach(filter => {                     // Создание фильтров с ползунками
            filterRange(filter, page, table);
        });
    })
    // Если при получении продуктов произошла ошибка:
    .catch(err => console.log(err.message));
};

export default products;