/* <================================================================================================================> */
/* <============================================== НЕОБХОДИМЫЕ МОДУЛИ ==============================================> */
/* <================================================================================================================> */

// 1. Модуль Gulp - предоставляет функционал для работы с  Gulp:
import gulp from "gulp";

// 2. Модуль Fonter - предоставляет функционал для преобразования шрифтов:
import fonter from "gulp-fonter";

// 3. Пользовательский модуль Path - предоставляет информацию о путях к необходимым файлам/папкам:
import { path } from "../../config/path.js";

/* <================================================================================================================> */
/* <============================================= КОНВЕРТАЦИЯ ШРИФТОВ ==============================================> */
/* <================================================================================================================> */

// Конвертация из otf в ttf:
export const otfToTtf = () => {
    return gulp.src(`${path.srcFolder}/fonts/*.otf`)    // Считываем из папки с исходниками шрифты в формате otf
        .pipe(fonter({ formats: ["ttf"] }))             // Преобразуем шрифты otf в формат ttf
        .pipe(gulp.dest(`${path.srcFolder}/fonts/`));   // Записываем полученные шрифты в папку с исходниками
};